tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "asdf"
brew "bat"
brew "exa"
brew "fnm"
brew "git"
brew "neovim"
brew "peco"
brew "stow"
brew "zsh"
cask "alfred"
cask "deepl"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "spectacle"
cask "visual-studio-code"
