tap "homebrew/bundle"
tap "homebrew/core"
brew "bat" # 色付きでファイルの内容を出力
brew "cocoapods" # brew経由のほうが新しい
brew "exa" # lsなどの表示の際に、アイコンを表示するため
brew "fnm" # nodeのバージョン管理ツール
brew "git" # brew経由のほうがversionが新しい
brew "lefthook" # gitのcommit前にlinterやformatterなどの処理を加えるツール
brew "neovim" #NeoVim
brew "peco"
brew "stow"
brew "zsh" # brew経由のほうがversionが新しい

tap "rcmdnk/file"
brew "rcmdnk/file/brew-file" # Brewfileを管理するツール

tap "leoafarias/fvm" # flutterのバージョン管理ツール
brew "leoafarias/fvm/fvm" # flutterのバージョン管理ツール

tap "homebrew/cask"
cask "deepl" # 翻訳アプリ
cask "google-japanese-ime" # Google日本語入力
cask "iterm2" # terminaアプリ
cask "karabiner-elements" # キーボード周りをカスタマイズできる
cask "raycast" # ランチャーアプリ
cask "visual-studio-code" #VScode
cask "warp" # 新しいTerminalアプリ
cask "fig" # ClI補完アプリ
cask "slack" # スラック
cask "zoom" # ズーム
cask "google-chrome" # Google Chrome

tap "homebrew/cask-fonts" # font用
cask "font-fira-code" # プログラミング用フォント
cask "font-hack-nerd-font"
