tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts" # font用
tap "homebrew/core"
tap "leoafarias/fvm" # flutterのバージョン管理ツール
brew "bat" # 色付きでファイルの内容を出力
brew "cocoapods"
brew "exa" # lsなどの表示の際に、アイコンを表示するため
brew "fnm" # nodeのバージョン管理ツール
brew "git"
brew "neovim"
brew "peco"
brew "stow"
brew "zsh"
brew "leoafarias/fvm/fvm"
cask "deepl"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "iterm2"
cask "karabiner-elements"
cask "visual-studio-code"
